hrshygoodness/EFM32-Library/v2/an/an0012_efm32_gpio/EFM32_Gxxx_STK/main_gpio_prs_stk.c
/*****************************************************************************
 * @file main_gpio_prs_stk.c
 * @brief GPIO Demo Application
 * @author Silicon Labs
 * @version 1.07
 ******************************************************************************
 * @section License
 * <b>(C) Copyright 2014 Silicon Labs, http://www.silabs.com</b>
 *******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Labs has no
 * obligation to support this Software. Silicon Labs is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Silicon Labs will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 ******************************************************************************/

#include "em_device.h"
#include "em_adc.h"
#include "em_cmu.h"
#include "em_emu.h"
#include "em_gpio.h"
#include "em_prs.h"
#include "em_chip.h"


ADC_InitSingle_TypeDef ADCInitSingle = 
{
  .prsSel = adcPRSSELCh0,
  .acqTime = adcAcqTime1,
  .reference = adcRefVDD,
  .resolution = adcRes8Bit,
  .input = adcSingleInpVDD,
  .diff = false,
  .prsEnable = true,
  .leftAdjust = false,
  .rep = false
};

ADC_Init_TypeDef ADCInit = ADC_INIT_DEFAULT;
uint32_t adcResult;

/**************************************************************************//**
 * @brief  Delay function
 * causes a delay equal to miliseconds input parameter
 *****************************************************************************/
void Delay(uint16_t milliseconds)
{
  uint16_t countMs=0;
  /* Initialize clock for TIMER0*/
  CMU->HFPERCLKEN0 |= CMU_HFPERCLKEN0_TIMER0; 
  
  TIMER0->CTRL = (TIMER0->CTRL & ~_TIMER_CTRL_CLKSEL_MASK) | TIMER_CTRL_CLKSEL_PRESCHFPERCLK; 
  TIMER0->CTRL = (TIMER0->CTRL & ~_TIMER_CTRL_PRESC_MASK) | TIMER_CTRL_PRESC_DIV1; //no prescaling
  TIMER0->IEN = (TIMER0->IEN & ~_TIMER_IEN_RESETVALUE) | TIMER_IEN_OF; //overflow interrupt enable 
  TIMER0->IFC = (TIMER0->IFC & ~_TIMER_IFC_MASK) | TIMER_IFC_OF; //clear interrupt flag
  TIMER0->TOP = 14285; //counts up to this value and goes back to 0 -> 1ms
  TIMER0->CMD = TIMER_CMD_START; 
  
  while(countMs < milliseconds)
  {
    if(TIMER0->IF & _TIMER_IF_OF_MASK) //overflow interrupt occured
    {
      countMs++; //1ms has passed, so increase counter
      TIMER0->IFC = (TIMER0->IFC & ~_TIMER_IFC_MASK) | TIMER_IFC_OF; //clear interrupt flag
    }  
  }
  
  TIMER0->CMD = TIMER_CMD_STOP;//stop timer
}

/**************************************************************************//**
 * @brief ADC0_IRQHandler
 * Interrupt Service Routine for ADC
 *****************************************************************************/
void ADC0_IRQHandler(void)
{ 
  /* Clear ADC0 interrupt flag */
  ADC0->IFC = 1;
  
  /* Read conversion result to clear Single Data Valid flag */
  adcResult = ADC0->SINGLEDATA;
}
/**************************************************************************//**
 * @brief  Main function
 * Main is called from __iar_program_start, see assembly startup file
 *****************************************************************************/
int main(void)
{  
  /* Initialize chip */
  CHIP_Init();
  
  /* Enable clock for GPIO module */
  CMU_ClockEnable(cmuClock_GPIO, true);
  
  /* Enable clock for ADC0 module */
  CMU_ClockEnable(cmuClock_ADC0, true);
  
  /* Enable clock for PRS module */
  CMU_ClockEnable(cmuClock_PRS, true);
  
  /* Configure PB9 as an input for PB0 button with filter enable (out = 1)*/
  GPIO_PinModeSet(gpioPortB, 9, gpioModeInput, 1); 
  
  /* Select PB9 as PRS output */
  GPIO->EXTIPSELH = (GPIO->EXTIPSELH & !_GPIO_EXTIPSELH_EXTIPSEL9_MASK ) | GPIO_EXTIPSELH_EXTIPSEL9_PORTB;
  
  /* Enable PRS sense */
  GPIO->INSENSE = GPIO->INSENSE | GPIO_INSENSE_PRS;
  
  /* Select GPIO as source and GPIOPIN9 as signal (falling edge) */
  PRS_SourceSignalSet(0, PRS_CH_CTRL_SOURCESEL_GPIOH, PRS_CH_CTRL_SIGSEL_GPIOPIN9, prsEdgeNeg);

  /* Initialize ADC common parts for both single conversion and scan sequence */
  ADC_Init(ADC0, &ADCInit);
  
  /* Initialize ADC single sample conversion */
  ADC_InitSingle(ADC0, &ADCInitSingle);
  
  /* Enable ADC Interrupt when Single Conversion Complete */
  ADC0->IEN = ADC_IEN_SINGLE;
  
  /* Enable ADC interrupt vector in NVIC*/
  NVIC_EnableIRQ(ADC0_IRQn);
   
  while(1)
  {
    /* Enter EM1 */ 
    EMU_EnterEM1();
    
    /* After ADC Single conversion wake up -> Delay 1000mS */  
    Delay(1000);
  }
}
